In [1]:
import pandas as pd

In [2]:
apples=[2,3,9,0,6,8,9,10]
mangos=[9,3,4,1,2,8,9,2]
apples

[2, 3, 9, 0, 6, 8, 9, 10]

In [3]:
mangos

[9, 3, 4, 1, 2, 8, 9, 2]

In [4]:
print(apples,mangos)

[2, 3, 9, 0, 6, 8, 9, 10] [9, 3, 4, 1, 2, 8, 9, 2]

In [5]:
data={"Apples":apples,"Mangos":mangos}
data

{'Apples': [2, 3, 9, 0, 6, 8, 9, 10], 'Mangos': [9, 3, 4, 1, 2, 8, 9, 2]}

In [6]:
fruits=pd.DataFrame(data)
fruits

   Apples  Mangos
0       2       9
1       3       3
2       9       4
3       0       1
4       6       2
5       8       8
6       9       9
7      10       2

In [7]:
fruits=pd.DataFrame(data, index =["a","b","c","d","e","f","g","h"])
fruits

   Apples  Mangos
a       2       9
b       3       3
c       9       4
d       0       1
e       6       2
f       8       8
g       9       9
h      10       2

In [8]:
print(fruits)

   Apples  Mangos
a       2       9
b       3       3
c       9       4
d       0       1
e       6       2
f       8       8
g       9       9
h      10       2

In [9]:
fruits=pd.DataFrame(data,index=["1st Day","Second Day","Third Day","Fourth Day","Fifth Day","sixth Day","Seventh Day","eight Day"])
fruits

             Apples  Mangos
1st Day           2       9
Second Day        3       3
Third Day         9       4
Fourth Day        0       1
Fifth Day         6       2
sixth Day         8       8
Seventh Day       9       9
eight Day        10       2

In [10]:
fruits.head()   # by default First 5 Show karay ga

            Apples  Mangos
1st Day          2       9
Second Day       3       3
Third Day        9       4
Fourth Day       0       1
Fifth Day        6       2

In [11]:
fruits.tail()     # by default Last 5 show Karay Ga

             Apples  Mangos
Fourth Day        0       1
Fifth Day         6       2
sixth Day         8       8
Seventh Day       9       9
eight Day        10       2

In [12]:
fruits.head(2)   # start k 2 Show kar day ga

            Apples  Mangos
1st Day          2       9
Second Day       3       3

In [13]:
fruits.tail(2)    # Last kay 2 show kar raha hay

             Apples  Mangos
Seventh Day       9       9
eight Day        10       2

In [14]:
fruits=pd.DataFrame(fruits,columns=["Mangos","Apples"])   # Is Tarah hum columns setting agay pechay kar saktay hain
fruits

             Mangos  Apples
1st Day           9       2
Second Day        3       3
Third Day         4       9
Fourth Day        1       0
Fifth Day         2       6
sixth Day         8       8
Seventh Day       9       9
eight Day         2      10

In [15]:
fruits=pd.DataFrame(fruits,columns=["Mangos","Apples","Bananas"])   # Is Tarah hum columns setting agay pechay kar saktay hain
fruits

             Mangos  Apples  Bananas
1st Day           9       2      NaN
Second Day        3       3      NaN
Third Day         4       9      NaN
Fourth Day        1       0      NaN
Fifth Day         2       6      NaN
sixth Day         8       8      NaN
Seventh Day       9       9      NaN
eight Day         2      10      NaN

In [16]:
fruits.columns   # Columns kay naam chk karnay ka tareqa

Index(['Mangos', 'Apples', 'Bananas'], dtype='object')

In [17]:
fruits.index   # index kay naam chk karnay ka tareqa

Index(['1st Day', 'Second Day', 'Third Day', 'Fourth Day', 'Fifth Day',
       'sixth Day', 'Seventh Day', 'eight Day'],
      dtype='object')

In [18]:
fruits.columns   # Jupitar may last wali command ka result dayta hay agar donu ka output chahiya to print command use karna 
fruits.index    # hogi

Index(['1st Day', 'Second Day', 'Third Day', 'Fourth Day', 'Fifth Day',
       'sixth Day', 'Seventh Day', 'eight Day'],
      dtype='object')

In [19]:
print(fruits.columns)  # Is tarah hum donu ka output lay saktay hain , yaad rahay donu index hain aik row index dosra column
print(fruits.index)    # index hay

Index(['Mangos', 'Apples', 'Bananas'], dtype='object')
Index(['1st Day', 'Second Day', 'Third Day', 'Fourth Day', 'Fifth Day',
       'sixth Day', 'Seventh Day', 'eight Day'],
      dtype='object')

In [20]:
data

{'Apples': [2, 3, 9, 0, 6, 8, 9, 10], 'Mangos': [9, 3, 4, 1, 2, 8, 9, 2]}

In [21]:
data["Apples"]  # is tareqay ko dict like notation kahtay hain, imay jo key dain gay us ki value aa jain ge

[2, 3, 9, 0, 6, 8, 9, 10]

In [22]:
fruits["Mangos"]  #yay dataframe may dict like notation ka treqa hay

1st Day        9
Second Day     3
Third Day      4
Fourth Day     1
Fifth Day      2
sixth Day      8
Seventh Day    9
eight Day      2
Name: Mangos, dtype: int64

In [23]:
fruits.Mangos  # yay Tariqa Attribute style hay . is ka bhi result same hay jo dict like notation ka hota hay

1st Day        9
Second Day     3
Third Day      4
Fourth Day     1
Fifth Day      2
sixth Day      8
Seventh Day    9
eight Day      2
Name: Mangos, dtype: int64

In [24]:
fruits.loc["sixth Day"]  # is tarha hum aik makhsoos raw ki sari values nikaal saktay hain

Mangos     8.0
Apples     8.0
Bananas    NaN
Name: sixth Day, dtype: float64

In [25]:
fruits.loc["eight Day"]

Mangos      2.0
Apples     10.0
Bananas     NaN
Name: eight Day, dtype: float64

In [26]:
fruits

             Mangos  Apples  Bananas
1st Day           9       2      NaN
Second Day        3       3      NaN
Third Day         4       9      NaN
Fourth Day        1       0      NaN
Fifth Day         2       6      NaN
sixth Day         8       8      NaN
Seventh Day       9       9      NaN
eight Day         2      10      NaN

In [27]:
fruits["Bananas"]=5   # is Tarah hum Bananas ki Empty Values ko fill kar saktay hain
fruits

             Mangos  Apples  Bananas
1st Day           9       2        5
Second Day        3       3        5
Third Day         4       9        5
Fourth Day        1       0        5
Fifth Day         2       6        5
sixth Day         8       8        5
Seventh Day       9       9        5
eight Day         2      10        5

In [33]:
import numpy as np
fruits["Bananas"]=np.arange(8)    # is Tarah hum Bananas ki Empty Values ko fill kar saktay hain
fruits

             Mangos  Apples  Bananas
1st Day           9       2        0
Second Day        3       3        1
Third Day         4       9        2
Fourth Day        1       0        3
Fifth Day         2       6        4
sixth Day         8       8        5
Seventh Day       9       9        6
eight Day         2      10        7

In [35]:
fruits["Bananas"]=np.arange(0,16,2)   # is Tarah hum Bananas ki Empty Values ko fill kar saktay hain
fruits

             Mangos  Apples  Bananas
1st Day           9       2        0
Second Day        3       3        2
Third Day         4       9        4
Fourth Day        1       0        6
Fifth Day         2       6        8
sixth Day         8       8       10
Seventh Day       9       9       12
eight Day         2      10       14

In [38]:
fruits["Bananas"]=pd.Series([5,9],index=["Third Day","sixth Day"]) 
fruits

             Mangos  Apples  Bananas
1st Day           9       2      NaN
Second Day        3       3      NaN
Third Day         4       9      5.0
Fourth Day        1       0      NaN
Fifth Day         2       6      NaN
sixth Day         8       8      9.0
Seventh Day       9       9      NaN
eight Day         2      10      NaN

In [42]:
fruits["Bananas"]["Third Day"]=8
fruits

C:\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

             Mangos  Apples  Bananas
1st Day           9       2      NaN
Second Day        3       3      NaN
Third Day         4       9      8.0
Fourth Day        1       0      NaN
Fifth Day         2       6      NaN
sixth Day         8       8      9.0
Seventh Day       9       9      NaN
eight Day         2      10      NaN

In [43]:
fruits["Stawbery"]=fruits.Mangos==2  # Is Tarah hum aik new column ko add kar saktay hain aur us ki values bhi boolen 
fruits                               # check kar saktay hain

             Mangos  Apples  Bananas  Stawbery
1st Day           9       2      NaN     False
Second Day        3       3      NaN     False
Third Day         4       9      8.0     False
Fourth Day        1       0      NaN     False
Fifth Day         2       6      NaN      True
sixth Day         8       8      9.0     False
Seventh Day       9       9      NaN     False
eight Day         2      10      NaN      True

In [44]:
del fruits["Stawbery"]   # is tarah dobara column ko del bhi kar saktay hain
fruits

             Mangos  Apples  Bananas
1st Day           9       2      NaN
Second Day        3       3      NaN
Third Day         4       9      8.0
Fourth Day        1       0      NaN
Fifth Day         2       6      NaN
sixth Day         8       8      9.0
Seventh Day       9       9      NaN
eight Day         2      10      NaN

In [45]:
fruits.T   # is tarha hum raws ko column aur column ko rows kar saktay hain  T for Transpose

,1st Day,Second Day,Third Day,Fourth Day,Fifth Day,sixth Day,Seventh Day,eight Day
Mangos,9.0,3.0,4.0,1.0,2.0,8.0,9.0,2.0
Apples,2.0,3.0,9.0,0.0,6.0,8.0,9.0,10.0
Bananas,NaN,NaN,8.0,NaN,NaN,9.0,NaN,NaN